{"posts":[{"title":"Hello World","text":"Welcome to Liming’s homepage!!!!!! themes/icarus/source/img/lm2.jpg About me: BiographyMing Li received the M.E. degree in Computer Science and Technology from Henan Normal University, Xinxiang, China, in 2024 (supervised by Prof. Peiyan Yuan). She worked at Hyperfusion Digital Co., Ltd. &amp; Zhengzhou College of Finance and Economics from August 2024 to June 2025. Currently, she is pursuing the Ph.D. degree in Information and Communication Engineering at Xidian University, Xi’an, China, under the supervision of Prof. Nan Cheng, and is a member of the Ubiquitous Networking and Intelligent Computing Lab (UNIC). Her main research interests include: Generative AI (focus on signal processing and practical applications); Decision-making AI (Lyapunov-based Deep Reinforcement Learning for Resource Allocation of Adaptive Communication Scenarios( • - • ) |つ 🚗,🛰️,✈️,📶……); Development of AI-driven plugin systems for intelligent communication systems (multi-agent resource scheduling, network resource management, and self-optimization). My skills Programming Language: C, Java, Matlab, Python, PHP, MySQL, GO, GUN/Linux, H5, C3, JS, JQuery.Hobby: The development of Web and APP &amp; Cluster construction. Experience Ph.D. student, 2025 to Present Information and Communication Engineering, School of Communication Engineering, Xidian University, Xi’an, China. August 2024 to June 2025. xFusion Digital Co., Ltd. &amp; Zhengzhou College of Finance and Economics, Zhengzhou, China. M.E. Degree: 2021 to July 2024. Computer Science and Technology, School of Computer and Information Engineering, Henan Normal University, Xinxiang, China (Supervisor: Prof. Peiyan Yuan). B.E. Degree: 2017 to 2021. Computer Science and Technology, School of Computer Science and Technology, Xinxiang University, Xinxiang, China. Honors “IEERA Cup” International College English Reading Competition (China Division), Second Prize, June 2023. IEERA (International English Education Research Association) 18th China Graduate Electronic Design Contest (GigaDevice Cup), Third Prize, July 2023. Project name: “A Lightweight and Personalized Image Recognition System Based on Edge Intelligence and Its Application”-Federated Learning","link":"/2025/12/16/hello-world/"}],"tags":[],"categories":[],"pages":[]}