{"posts":[{"title":"New AI Research Paper","text":"New AI Research PaperThis is a new AI research paper published recently. AbstractThis paper presents novel findings in the field of artificial intelligence, focusing on deep learning architectures for natural language processing. IntroductionArtificial intelligence has made significant progress in recent years… MethodologyWe used transformer-based models for our experiments… ResultsOur model achieved state-of-the-art performance on benchmark datasets. ConclusionThis research contributes to the advancement of AI technology.","link":"/2025/12/18/1/"},{"title":"","text":"","link":"/2025/12/21/about1/"},{"title":"Academic Life at Xidian University","text":"Academic Life at Xidian UniversitySharing my experience as a PhD student. Research Environment Lab facilities and resources Collaboration opportunities Conference participation Daily Routine Research work Coursework Paper writing Challenges and RewardsBalancing research, teaching, and personal life.","link":"/2025/12/17/academic-life/"},{"title":"Deep Learning Fundamentals","text":"Deep Learning FundamentalsUnderstanding the basics of deep learning. Neural Networks Perceptrons Multi-layer networks Backpropagation Architectures CNNs for computer vision RNNs for sequential data Transformers for NLP ApplicationsImage recognition, speech processing, and more.","link":"/2025/12/17/deep-learning/"},{"title":"AI Research Overview","text":"AI Research OverviewThis article provides an overview of current AI research trends. IntroductionArtificial Intelligence has evolved rapidly in recent years… Key Areas Machine Learning Deep Learning Natural Language Processing Computer Vision Future DirectionsThe future of AI looks promising with advancements in…","link":"/2025/12/17/ai-research/"},{"title":"Hello World","text":"Welcome to Liming’s Homepage!!!!!! \"Rejoice at blooming flowers, and not grieve when they fade\" — 花开随喜，花落不悲 About MeMing Li received the M.E. degree in Computer Science and Technology from Henan Normal University (Xinxiang, China) in 2024, supervised by Prof. Peiyan Yuan . From August 2024 to June 2025, she worked at xFusion Digital Co., Ltd. &amp; Zhengzhou College of Finance and Economics (Zhengzhou, China). Currently, she is pursuing the Ph.D. degree in Information and Communication Engineering at Xidian University (Xi’an, China), under the supervision of Prof. Nan Cheng , and is a core member of the ✨Ubiquitous Networking and Intelligent Computing Lab (UNIC). 🔍 Main Research Interests Generative AI: Focus on signal processing and practical scenario implementation Decision-Making AI: Lyapunov-based Deep Reinforcement Learning for resource allocation in adaptive communication scenarios &nbsp;&nbsp;&nbsp;&nbsp;(Targeting 🚗 V2X Networks / 🛰️ Satellite Communication / ✈️ Aeronautical Communication / 📶 Mobile Communication) AI-Driven Plugin Development for Intelligent Communication Systems: Multi-agent resource scheduling, network resource management, and self-optimization 🛠️ Technical Skills Programming Languages C, Java, Matlab, Python, PHP, Go Databases MySQL Operating Systems GNU/Linux Frontend Technologies HTML5, CSS3, JavaScript, jQuery Hobbies & Interests Web/APP Development, Cluster Construction & Operation 📖 Education &amp; Professional Experience 🎓 Ph.D. Student (2025 - Present) Information and Communication Engineering School of Communication Engineering, Xidian University (Xi’an, China) 💼 Professional Experience (August 2024 - June 2025) xFusion Digital Co., Ltd. & Zhengzhou College of Finance and Economics (Zhengzhou, China) 🎓 M.E. Degree (2021 - July 2024) Computer Science and Technology School of Computer and Information Engineering, Henan Normal University (Xinxiang, China) Supervisor: Prof. Peiyan Yuan 🎓 B.E. Degree (2017 - 2021) Computer Science and Technology School of Computer Science and Technology, Xinxiang University (Xinxiang, China) 🏆 Honors &amp; Awards 🏅 Second Prize | June 2023 \"IEERA Cup\" International College English Reading Competition (China Division) Hosted by IEERA (International English Education Research Association) 🏅 Third Prize | July 2023 18th China Graduate Electronic Design Contest (GigaDevice Cup) Project: \"A Lightweight and Personalized Image Recognition System Based on Edge Intelligence and Its Application\" (Federated Learning) © 2025 Liming's Personal Homepage | Last Updated: December 16, 2025","link":"/2025/12/16/hello-world/"},{"title":"AI-Powered Communication System Project","text":"AI-Powered Communication System ProjectThis project focuses on developing an intelligent agents communication system using deep reinforcement learning for resource allocation. Project OverviewThe goal is to create an adaptive communication system that can: Dynamically allocate network resources Optimize bandwidth usage Improve overall system efficiency Technologies Used Deep Reinforcement Learning (DRL) algorithms Python with PyTorch/TensorFlow Network simulation tools Real-time monitoring dashboard Key Features Adaptive Resource Allocation: Uses DRL to make real-time decisions Scalable Architecture: Can handle varying network loads Energy Efficiency: Optimizes power consumption Fault Tolerance: Self-healing capabilities Implementation StatusCurrently in development phase, with prototype testing underway.","link":"/2025/12/17/project-ai-system/"},{"title":"Modern Web Development","text":"Modern Web DevelopmentExploring the latest trends in web development. Frontend Frameworks React Vue.js Angular Backend Technologies Node.js Python Django Java Spring Best PracticesCode organization, testing, and deployment strategies.","link":"/2025/12/17/web-development/"},{"title":"React Tutorial for Beginners","text":"React Tutorial for BeginnersA comprehensive guide to getting started with React. Getting Started Setting up development environment Creating your first component Understanding JSX Core Concepts Components and props State and lifecycle Hooks Advanced Topics Context API Redux for state management Performance optimization","link":"/2025/12/17/react-tutorial/"},{"title":"Reading Notes - Deep Learning Book","text":"Reading Notes: Deep Learning Book by Ian GoodfellowThis is my reading notes for the classic “Deep Learning” book by Ian Goodfellow, Yoshua Bengio, and Aaron Courville. Chapter 1: IntroductionKey Concepts Machine Learning: Algorithms that improve automatically through experience Deep Learning: A subset of machine learning using multiple layers Representation Learning: Learning useful representations of data Important Points The curse of dimensionality The importance of feature engineering vs. automatic feature learning Historical context of neural networks Chapter 2: Linear AlgebraMatrix Operations Matrix multiplication properties Eigenvalues and eigenvectors Singular Value Decomposition (SVD) Applications in Deep Learning Weight matrices in neural networks Covariance matrices for data analysis Principal Component Analysis (PCA) Chapter 3: Probability and Information TheoryProbability Distributions Bernoulli, Gaussian, Multinomial distributions Conditional probability and Bayes’ rule Maximum Likelihood Estimation (MLE) Information Theory Entropy and cross-entropy Kullback-Leibler divergence Mutual information Personal InsightsThis book provides a solid mathematical foundation for understanding deep learning. The explanations are clear, though some sections require careful reading due to the mathematical complexity.","link":"/2025/12/17/reading-deep-learning-book/"}],"tags":[{"name":"ai","slug":"ai","link":"/tags/ai/"},{"name":"research","slug":"research","link":"/tags/research/"},{"name":"papers","slug":"papers","link":"/tags/papers/"},{"name":"study","slug":"study","link":"/tags/study/"},{"name":"life","slug":"life","link":"/tags/life/"},{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"deep-learning","slug":"deep-learning","link":"/tags/deep-learning/"},{"name":"neural-networks","slug":"neural-networks","link":"/tags/neural-networks/"},{"name":"machine-learning","slug":"machine-learning","link":"/tags/machine-learning/"},{"name":"Technology","slug":"technology","link":"/tags/technology/"},{"name":"Blog","slug":"blog","link":"/tags/blog/"},{"name":"Programming","slug":"programming","link":"/tags/programming/"},{"name":"Learning","slug":"learning","link":"/tags/learning/"},{"name":"Artificial Intelligence","slug":"artificial-intelligence","link":"/tags/artificial-intelligence/"},{"name":"Communication Engineering","slug":"communication-engineering","link":"/tags/communication-engineering/"},{"name":"projects","slug":"projects","link":"/tags/projects/"},{"name":"communication-ai-systems","slug":"communication-ai-systems","link":"/tags/communication-ai-systems/"},{"name":"agents","slug":"agents","link":"/tags/agents/"},{"name":"Web","slug":"web","link":"/tags/web/"},{"name":"JavaScript","slug":"javascript","link":"/tags/javascript/"},{"name":"React","slug":"react","link":"/tags/react/"},{"name":"react","slug":"react","link":"/tags/react/"},{"name":"javascript","slug":"javascript","link":"/tags/javascript/"},{"name":"frontend","slug":"frontend","link":"/tags/frontend/"},{"name":"reading","slug":"reading","link":"/tags/reading/"},{"name":"books","slug":"books","link":"/tags/books/"},{"name":"notes","slug":"notes","link":"/tags/notes/"}],"categories":[{"name":"Publications","slug":"Publications","link":"/categories/Publications/"},{"name":"Blog","slug":"Blog","link":"/categories/Blog/"},{"name":"Projects","slug":"Projects","link":"/categories/Projects/"},{"name":"Courses","slug":"Courses","link":"/categories/Courses/"},{"name":"Reading","slug":"Reading","link":"/categories/Reading/"}],"pages":[{"title":"Test","text":"","link":"/test.html"},{"title":"Publications","text":"","link":"/publications/index.html"},{"title":"Courses","text":"","link":"/courses/index.html"},{"title":"Blog","text":"","link":"/blog/index.html"},{"title":"Reading","text":"","link":"/reading/index.html"},{"title":"Projects","text":"","link":"/projects/index.html"}]}